Testing Multiple GETs...
Generating random data files...
Uploading files to any@192.168.69.2...
Connected to 192.168.69.2.
sftp> put ./512B_random
Uploading ./512B_random to ./demo/sftp/std/testing/out/512B_random
512B_random                                                 100%  512   443.9KB/s   00:00    
sftp> put ./16kB_random
Uploading ./16kB_random to ./demo/sftp/std/testing/out/16kB_random
16kB_random                                                 100%   16KB 260.0KB/s   00:00    
sftp> put ./64kB_random
Uploading ./64kB_random to ./demo/sftp/std/testing/out/64kB_random
64kB_random                                                 100%   64KB 255.3KB/s   00:00    
sftp> put ./65kB_random
Uploading ./65kB_random to ./demo/sftp/std/testing/out/65kB_random
65kB_random                                                 100%   65KB 201.3KB/s   00:00    
sftp> 
sftp> bye
client_loop: send disconnect: Broken pipe
UPLOAD Test Results:
=============
Upload PASS: 512B_random
Upload PASS: 16kB_random
Upload PASS: 64kB_random
Upload PASS: 65kB_random
Cleaning up original files...
OpenSSH_8.9p1 Ubuntu-3ubuntu0.13, OpenSSL 3.0.2 15 Mar 2022
debug1: Reading configuration data /home/jubeor/.ssh/config
debug1: Reading configuration data /etc/ssh/ssh_config
debug1: /etc/ssh/ssh_config line 19: include /etc/ssh/ssh_config.d/*.conf matched no files
debug1: /etc/ssh/ssh_config line 21: Applying options for *
debug2: resolve_canonicalize: hostname 192.168.69.2 is address
debug3: ssh_connect_direct: entering
debug1: Connecting to 192.168.69.2 [192.168.69.2] port 22.
debug3: set_sock_tos: set socket 3 IP_TOS 0x10
debug1: Connection established.
debug1: identity file /home/jubeor/.ssh/id_rsa type 0
debug1: identity file /home/jubeor/.ssh/id_rsa-cert type -1
debug1: identity file /home/jubeor/.ssh/id_ecdsa type -1
debug1: identity file /home/jubeor/.ssh/id_ecdsa-cert type -1
debug1: identity file /home/jubeor/.ssh/id_ecdsa_sk type -1
debug1: identity file /home/jubeor/.ssh/id_ecdsa_sk-cert type -1
debug1: identity file /home/jubeor/.ssh/id_ed25519 type -1
debug1: identity file /home/jubeor/.ssh/id_ed25519-cert type -1
debug1: identity file /home/jubeor/.ssh/id_ed25519_sk type -1
debug1: identity file /home/jubeor/.ssh/id_ed25519_sk-cert type -1
debug1: identity file /home/jubeor/.ssh/id_xmss type -1
debug1: identity file /home/jubeor/.ssh/id_xmss-cert type -1
debug1: identity file /home/jubeor/.ssh/id_dsa type -1
debug1: identity file /home/jubeor/.ssh/id_dsa-cert type -1
debug1: Local version string SSH-2.0-OpenSSH_8.9p1 Ubuntu-3ubuntu0.13
debug1: Remote protocol version 2.0, remote software version Sunset-1
debug1: compat_banner: no match: Sunset-1
debug2: fd 3 setting O_NONBLOCK
debug1: Authenticating to 192.168.69.2:22 as 'any'
debug1: load_hostkeys: fopen /etc/ssh/ssh_known_hosts: No such file or directory
debug1: load_hostkeys: fopen /etc/ssh/ssh_known_hosts2: No such file or directory
debug3: order_hostkeyalgs: no algorithms matched; accept original
debug3: send packet: type 20
debug1: SSH2_MSG_KEXINIT sent
debug3: receive packet: type 20
debug1: SSH2_MSG_KEXINIT received
debug2: local client KEXINIT proposal
debug2: KEX algorithms: curve25519-sha256,curve25519-sha256@libssh.org,ecdh-sha2-nistp256,ecdh-sha2-nistp384,ecdh-sha2-nistp521,sntrup761x25519-sha512@openssh.com,diffie-hellman-group-exchange-sha256,diffie-hellman-group16-sha512,diffie-hellman-group18-sha512,diffie-hellman-group14-sha256,ext-info-c,kex-strict-c-v00@openssh.com
debug2: host key algorithms: ssh-ed25519-cert-v01@openssh.com,ecdsa-sha2-nistp256-cert-v01@openssh.com,ecdsa-sha2-nistp384-cert-v01@openssh.com,ecdsa-sha2-nistp521-cert-v01@openssh.com,sk-ssh-ed25519-cert-v01@openssh.com,sk-ecdsa-sha2-nistp256-cert-v01@openssh.com,rsa-sha2-512-cert-v01@openssh.com,rsa-sha2-256-cert-v01@openssh.com,ssh-ed25519,ecdsa-sha2-nistp256,ecdsa-sha2-nistp384,ecdsa-sha2-nistp521,sk-ssh-ed25519@openssh.com,sk-ecdsa-sha2-nistp256@openssh.com,rsa-sha2-512,rsa-sha2-256
debug2: ciphers ctos: chacha20-poly1305@openssh.com,aes128-ctr,aes192-ctr,aes256-ctr,aes128-gcm@openssh.com,aes256-gcm@openssh.com
debug2: ciphers stoc: chacha20-poly1305@openssh.com,aes128-ctr,aes192-ctr,aes256-ctr,aes128-gcm@openssh.com,aes256-gcm@openssh.com
debug2: MACs ctos: umac-64-etm@openssh.com,umac-128-etm@openssh.com,hmac-sha2-256-etm@openssh.com,hmac-sha2-512-etm@openssh.com,hmac-sha1-etm@openssh.com,umac-64@openssh.com,umac-128@openssh.com,hmac-sha2-256,hmac-sha2-512,hmac-sha1
debug2: MACs stoc: umac-64-etm@openssh.com,umac-128-etm@openssh.com,hmac-sha2-256-etm@openssh.com,hmac-sha2-512-etm@openssh.com,hmac-sha1-etm@openssh.com,umac-64@openssh.com,umac-128@openssh.com,hmac-sha2-256,hmac-sha2-512,hmac-sha1
debug2: compression ctos: none,zlib@openssh.com,zlib
debug2: compression stoc: none,zlib@openssh.com,zlib
debug2: languages ctos: 
debug2: languages stoc: 
debug2: first_kex_follows 0 
debug2: reserved 0 
debug2: peer server KEXINIT proposal
debug2: KEX algorithms: mlkem768x25519-sha256,curve25519-sha256,curve25519-sha256@libssh.org,kex-strict-s-v00@openssh.com,kexguess2@matt.ucc.asn.au
debug2: host key algorithms: ssh-ed25519,rsa-sha2-256
debug2: ciphers ctos: chacha20-poly1305@openssh.com,aes256-ctr
debug2: ciphers stoc: chacha20-poly1305@openssh.com,aes256-ctr
debug2: MACs ctos: hmac-sha2-256
debug2: MACs stoc: hmac-sha2-256
debug2: compression ctos: none
debug2: compression stoc: none
debug2: languages ctos: 
debug2: languages stoc: 
debug2: first_kex_follows 0 
debug2: reserved 0 
debug3: kex_choose_conf: will use strict KEX ordering
debug1: kex: algorithm: curve25519-sha256
debug1: kex: host key algorithm: ssh-ed25519
debug1: kex: server->client cipher: chacha20-poly1305@openssh.com MAC: <implicit> compression: none
debug1: kex: client->server cipher: chacha20-poly1305@openssh.com MAC: <implicit> compression: none
debug3: send packet: type 30
debug1: expecting SSH2_MSG_KEX_ECDH_REPLY
debug3: receive packet: type 31
debug1: SSH2_MSG_KEX_ECDH_REPLY received
debug1: Server host key: ssh-ed25519 SHA256:6zdZ/bJAJoPDsk3YaJeckvI8Vbl8JmpTVfJH1ldlhyQ
debug1: load_hostkeys: fopen /etc/ssh/ssh_known_hosts: No such file or directory
debug1: load_hostkeys: fopen /etc/ssh/ssh_known_hosts2: No such file or directory
Warning: Permanently added '192.168.69.2' (ED25519) to the list of known hosts.
debug3: send packet: type 21
debug1: ssh_packet_send2_wrapped: resetting send seqnr 3
debug2: ssh_set_newkeys: mode 1
debug1: rekey out after 134217728 blocks
debug1: SSH2_MSG_NEWKEYS sent
debug1: expecting SSH2_MSG_NEWKEYS
debug3: receive packet: type 21
debug1: ssh_packet_read_poll2: resetting read seqnr 3
debug1: SSH2_MSG_NEWKEYS received
debug2: ssh_set_newkeys: mode 0
debug1: rekey in after 134217728 blocks
debug1: Will attempt key: /home/jubeor/.ssh/id_rsa RSA SHA256:Wc43s4t4VZ5DkRa7At3RMd9E0u/UH4CV75mWxI0G8A4
debug1: Will attempt key: /home/jubeor/.ssh/id_ecdsa 
debug1: Will attempt key: /home/jubeor/.ssh/id_ecdsa_sk 
debug1: Will attempt key: /home/jubeor/.ssh/id_ed25519 
debug1: Will attempt key: /home/jubeor/.ssh/id_ed25519_sk 
debug1: Will attempt key: /home/jubeor/.ssh/id_xmss 
debug1: Will attempt key: /home/jubeor/.ssh/id_dsa 
debug2: pubkey_prepare: done
debug3: send packet: type 5
debug3: receive packet: type 7
debug1: SSH2_MSG_EXT_INFO received
debug1: kex_input_ext_info: server-sig-algs=<rsa-sha2-256,ssh-ed25519>
debug3: receive packet: type 6
debug2: service_accept: ssh-userauth
debug1: SSH2_MSG_SERVICE_ACCEPT received
debug3: send packet: type 50
debug3: receive packet: type 52
Authenticated to 192.168.69.2 ([192.168.69.2]:22) using "none".
debug1: channel 0: new [client-session]
debug3: ssh_session2_open: channel_new: 0
debug2: channel 0: send open
debug3: send packet: type 90
debug1: Entering interactive session.
debug1: pledge: network
debug3: receive packet: type 91
debug2: channel_input_open_confirmation: channel 0: callback start
debug2: fd 3 setting TCP_NODELAY
debug3: set_sock_tos: set socket 3 IP_TOS 0x08
debug2: client_session2_setup: id 0
debug1: Sending environment.
debug3: Ignored env SHELL
debug3: Ignored env USER_ZDOTDIR
debug3: Ignored env COLORTERM
debug3: Ignored env WSL2_GUI_APPS_ENABLED
debug3: Ignored env TERM_PROGRAM_VERSION
debug3: Ignored env WSL_DISTRO_NAME
debug3: Ignored env NAME
debug3: Ignored env PWD
debug3: Ignored env NIX_PROFILES
debug3: Ignored env LOGNAME
debug3: Ignored env VSCODE_GIT_ASKPASS_NODE
debug3: Ignored env VSCODE_INJECTION
debug3: Ignored env HOME
debug1: channel 0: setting env LANG = "C.UTF-8"
debug2: channel 0: request env confirm 0
debug3: send packet: type 98
debug3: Ignored env WSL_INTEROP
debug3: Ignored env LS_COLORS
debug3: Ignored env WAYLAND_DISPLAY
debug3: Ignored env NIX_SSL_CERT_FILE
debug3: Ignored env GIT_ASKPASS
debug3: Ignored env VSCODE_GIT_ASKPASS_EXTRA_ARGS
debug3: Ignored env VSCODE_PYTHON_AUTOACTIVATE_GUARD
debug3: Ignored env TERM
debug3: Ignored env ZDOTDIR
debug3: Ignored env USER
debug3: Ignored env VSCODE_GIT_IPC_HANDLE
debug3: Ignored env DISPLAY
debug3: Ignored env SHLVL
debug3: Ignored env XDG_RUNTIME_DIR
debug3: Ignored env WSLENV
debug3: Ignored env VSCODE_GIT_ASKPASS_MAIN
debug3: Ignored env XDG_DATA_DIRS
debug3: Ignored env PATH
debug3: Ignored env DBUS_SESSION_BUS_ADDRESS
debug3: Ignored env HOSTTYPE
debug3: Ignored env PULSE_SERVER
debug3: Ignored env OLDPWD
debug3: Ignored env TERM_PROGRAM
debug3: Ignored env VSCODE_IPC_HOOK_CLI
debug3: Ignored env _
debug1: Sending subsystem: sftp
debug2: channel 0: request subsystem confirm 1
debug3: send packet: type 98
debug2: channel_input_open_confirmation: channel 0: callback done
debug2: channel 0: open confirm rwindow 1000 rmax 1000
debug3: receive packet: type 99
debug2: channel_input_status_confirm: type 99 id 0
debug2: subsystem request accepted on channel 0
debug2: Remote version: 3
Connected to 192.168.69.2.
debug2: Sending SSH2_FXP_REALPATH "."
debug3: Sent message fd 3 T:16 I:1
debug3: SSH2_FXP_REALPATH . -> ./demo/sftp/std/testing/out/
sftp> get ./512B_random
debug3: Looking up ./demo/sftp/std/testing/out/./512B_random
debug3: Sent message fd 3 T:7 I:2
debug3: Received stat reply T:105 I:2 F:0x000f M:100644
Fetching ./demo/sftp/std/testing/out/./512B_random to 512B_random
debug2: do_download: download remote "./demo/sftp/std/testing/out/./512B_random" to local "512B_random"
debug2: Sending SSH2_FXP_STAT "./demo/sftp/std/testing/out/./512B_random"
debug3: Sent message fd 3 T:17 I:3
debug3: Received stat reply T:105 I:3 F:0x000f M:100644
debug2: Sending SSH2_FXP_OPEN "./demo/sftp/std/testing/out/./512B_random"
debug3: Sent remote message SSH2_FXP_OPEN I:4 P:./demo/sftp/std/testing/out/./512B_random M:0x0001
512B_random                                                   0%    0     0.0KB/s   --:-- ETAdebug3: Request range 0 -> 32767 (0/1)
debug3: Received reply T:103 I:5 R:1
debug3: Received data 0 -> 511
debug3: Short data block, re-requesting 512 -> 32767 ( 1)
debug3: Finish at 32768 ( 1)
debug3: Received reply T:101 I:6 R:1
512B_random                                                 100%  512    11.0KB/s   00:00    
debug3: Sent message SSH2_FXP_CLOSE I:7
debug3: SSH2_FXP_STATUS 0
sftp> get ./16kB_random
debug3: Looking up ./demo/sftp/std/testing/out/./16kB_random
debug3: Sent message fd 3 T:7 I:8
debug3: Received stat reply T:105 I:8 F:0x000f M:100644
Fetching ./demo/sftp/std/testing/out/./16kB_random to 16kB_random
debug2: do_download: download remote "./demo/sftp/std/testing/out/./16kB_random" to local "16kB_random"
debug2: Sending SSH2_FXP_STAT "./demo/sftp/std/testing/out/./16kB_random"
debug3: Sent message fd 3 T:17 I:9
debug2: channel 0: rcvd adjust 516
debug3: Received stat reply T:105 I:9 F:0x000f M:100644
debug2: Sending SSH2_FXP_OPEN "./demo/sftp/std/testing/out/./16kB_random"
debug3: Sent remote message SSH2_FXP_OPEN I:10 P:./demo/sftp/std/testing/out/./16kB_random M:0x0001
16kB_random                                                   0%    0     0.0KB/s   --:-- ETAdebug3: Request range 0 -> 32767 (0/1)
debug3: Received reply T:103 I:11 R:1
debug3: Received data 0 -> 16383
debug3: Short data block, re-requesting 16384 -> 32767 ( 1)
debug3: Finish at 32768 ( 1)
debug3: Received reply T:101 I:12 R:1
16kB_random                                                 100%   16KB 332.6KB/s   00:00    
debug3: Sent message SSH2_FXP_CLOSE I:13
debug3: SSH2_FXP_STATUS 0
sftp> get ./64kB_random
debug3: Looking up ./demo/sftp/std/testing/out/./64kB_random
debug3: Sent message fd 3 T:7 I:14
debug3: Received stat reply T:105 I:14 F:0x000f M:100644
Fetching ./demo/sftp/std/testing/out/./64kB_random to 64kB_random
debug2: do_download: download remote "./demo/sftp/std/testing/out/./64kB_random" to local "64kB_random"
debug2: Sending SSH2_FXP_STAT "./demo/sftp/std/testing/out/./64kB_random"
debug3: Sent message fd 3 T:17 I:15
debug3: Received stat reply T:105 I:15 F:0x000f M:100644
debug2: Sending SSH2_FXP_OPEN "./demo/sftp/std/testing/out/./64kB_random"
debug3: Sent remote message SSH2_FXP_OPEN I:16 P:./demo/sftp/std/testing/out/./64kB_random M:0x0001
64kB_random                                                   0%    0     0.0KB/s   --:-- ETAdebug3: Request range 0 -> 32767 (0/1)
debug3: Received reply T:103 I:17 R:1
debug3: Received data 0 -> 32767
debug3: Request range 32768 -> 65535 (0/2)
debug3: Request range 65536 -> 98303 (1/2)
debug2: channel 0: rcvd adjust 520
debug3: Received reply T:103 I:18 R:2
debug3: Received data 32768 -> 65535
debug3: Finish at 98304 ( 1)
debug3: Received reply T:101 I:19 R:1
64kB_random                                                 100%   64KB 631.8KB/s   00:00    
debug3: Sent message SSH2_FXP_CLOSE I:20
debug3: SSH2_FXP_STATUS 0
sftp> get ./65kB_random
debug3: Looking up ./demo/sftp/std/testing/out/./65kB_random
debug3: Sent message fd 3 T:7 I:21
debug3: Received stat reply T:105 I:21 F:0x000f M:100644
Fetching ./demo/sftp/std/testing/out/./65kB_random to 65kB_random
debug2: do_download: download remote "./demo/sftp/std/testing/out/./65kB_random" to local "65kB_random"
debug2: Sending SSH2_FXP_STAT "./demo/sftp/std/testing/out/./65kB_random"
debug3: Sent message fd 3 T:17 I:22
debug3: Received stat reply T:105 I:22 F:0x000f M:100644
debug2: Sending SSH2_FXP_OPEN "./demo/sftp/std/testing/out/./65kB_random"
debug3: Sent remote message SSH2_FXP_OPEN I:23 P:./demo/sftp/std/testing/out/./65kB_random M:0x0001
65kB_random                                                   0%    0     0.0KB/s   --:-- ETAdebug3: Request range 0 -> 32767 (0/1)
debug2: channel 0: window 1998336 sent adjust 98816
debug3: Received reply T:103 I:24 R:1
debug3: Received data 0 -> 32767
debug3: Request range 32768 -> 65535 (0/2)
debug3: Request range 65536 -> 98303 (1/2)
debug3: Received reply T:103 I:25 R:2
debug3: Received data 32768 -> 65535
debug3: Finish at 98304 ( 1)
65kB_random                                                  98%   64KB  20.1KB/s - stalled -debug3: send packet: type 1
debug1: channel 0: free: client-session, nchannels 1
debug3: channel 0: status: The following connections are open:
  #0 client-session (t4 r0 i0/0 o0/0 e[write]/0 fd 4/5/6 sock -1 cc -1 io 0x01/0x02)

Killed by signal 15.
DOWNLOAD Test Results:
=============
Download PASS: 512B_random
Download PASS: 16kB_random
Download PASS: 64kB_random
Download FAIL: 65kB_random
Cleaning up local files...